INSERT INTO ADDRESS(ID, POSTCODE, CITY, STREET, HOUSE, APARTMENT)
VALUES (1, '100100', 'Москва', 'пр-кт Мира', '28к1', '50'),
       (2, '999999', 'Сочи', 'Некрасова', '11к3', '17'),
       (3, '111111', 'Санкт-Петербург', 'Новая', '12', '1'),
       (4, '333333', 'Екатеринбург', 'Сосновая', '233а', '43'),
       (5, '444444', 'Новосибирск', 'пр-кт Вернадского', '2', '6'),
       (6, '555555', 'Уфа', 'Солнцева', '100а', '543'),
       (7, '666666', 'Тула', 'Пушкина', '32в', '87'),
       (8, '888888', 'Геленджик', 'Гоголя', '54б', '45'),
       (9, '123456', 'Томск', 'Строителя', '8', '12'),
       (10, '654321', 'Норильск', 'пр-кт Ленина', '34', '78'),
       (11, '717171', 'Казань', 'Волжская', '5а', '435');

INSERT INTO COMPANY(ID, NAME, LEGAL_FORM, REGISTRATION_DATE, ADDRESS_ID)
VALUES (1, 'Божья коровка', 0, '2008-7-04', 1),
       (2, 'Ромашка', 1, '2022-10-15', 3),
       (3, 'Морская звезда', 0, '1999-1-08', 5),
       (4, 'Сокол', 2, '2017-12-29', 6),
       (5, 'Кола', 1, '2009-3-03', 7),
       (6, 'Дед Мороз', 1, '1985-6-19', 8),
       (7, 'Волчья стая', 2, '2001-10-26', 9);

INSERT INTO BRANCH(ID, NAME, REGISTRATION_DATE, ADDRESS_ID, COMPANY_ID)
VALUES (1, 'Приморский', '2012-11-23', 2, 1),
       (2, 'Уральский', '2023-1-08', 4, 2),
       (3, 'Южный', '2018-6-14', 10, 4),
       (4, 'Центральный', '2002-12-21', 11, 7);